## Plan Result (sbox_landing - TerraformPlanApply)




<pre><code>Plan: 0 to add, 5 to change, 0 to destroy.</code></pre>

* Update
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_windows_virtual_machine.winvm[0]
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        name                                          = "ingest00-data-bricks-product-private-sbox"
      ~ service_endpoints                             = [
          - "Microsoft.Storage",
        ]
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-public-sbox"
        name                                          = "ingest00-data-bricks-product-public-sbox"
      ~ service_endpoints                             = [
          - "Microsoft.Storage",
        ]
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00landingsbox"
        name                               = "ingest00landingsbox"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox",
              - "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-public-sbox",
                # (2 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["01"].module.legacy_database["legacy-sql"].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest01-legacy-sql-sbox"
        name                                                   = "ingest01-legacy-sql-sbox"
        tags                                                   = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
      ~ vm_agent_platform_updates_enabled                      = true -> false
        # (41 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
        id                                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss-sbox"
        name                                              = "ingest00-shir001-vmss-sbox"
        tags                                              = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (33 unchanged attributes hidden)

      - scale_in {
          - force_deletion_enabled = false -> null
          - rule                   = "Default" -> null
        }

        # (5 unchanged blocks hidden)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":56,"Program":"tfcmt","SHA1":"","Target":"sbox_landing - TerraformPlanApply","Vars":{}} -->